import { TNewsItem } from './types'

export const mockNews: TNewsItem[] = [
  {
    id: 1,
    title: 'Что вы знаете о сортировке мусора?',
    text:
      'В Москве и некоторых регионах уже год действует программа раздельного сбора мусора. Кто-то уже научился разбираться в маркировке, правильно сортировать отходы, а для кого-то это все еще непривычно. Этот тест мы придумали вместе с Colgate, который выпустил новую пасту в перерабатываемой упаковке, и экопроектом «Собиратор». Давайте проверим, насколько в теме мусора и раздельного сбора поднаторели вы.',
    author: 'Вася Пупкин',
    tag: 'Увлекательные тесты',
    time: '20:20',
  },
  {
    id: 2,
    title: 'Как не покупать ненужное?',
    text:
      'Декабрь традиционно считается временем распродаж и больших (если не сказать огромных) трат. В этом году весь ажиотаж переместился в онлайн, но от этого не стал меньше. Вместе с сервисом «Яндекс.Маркет» рассказываем, как закупаться так, чтобы не остаться 1 января без гроша.',
    author: 'Виктор Петров',
    tag: 'Партнёрский материал',
    time: '18:40',
  },
  {
    id: 3,
    title: '«Роллтон» или «Доширак»? По-настоящему важный тест с интригой!',
    text:
      'Внимание! Важнейшая новость: «Доширак» обгоняет «Роллтон» по темпам выручки на рынке РФ. Вот где есть реальная борьба и интрига. Сможете их не перепутать в нашем тесте? Да начнется кулинарная битва!',
    author: 'Иван Иванов',
    tag: 'Увлекательные тесты',
    time: '16:35',
  },
  {
    id: 4,
    title: 'Китай поднял флаг на Луне',
    text:
      'Китайский лунный модуль «Чанъэ-5» установил на поверхности Луны флаг Китая. «Чанъэ-5» прилунился 1 декабря; основная цель миссии — сбор лунного грунта и его доставка на Землю: в случае успеха Китай станет третьей страной в мире, которая сделает это. США и СССР несколько раз привозили на Землю лунный грунт в 1969-1976 годах. ',
    author: 'Пётр Петренко',
    tag: 'Важные новости',
    time: '15:00',
  },
  {
    id: 5,
    title: 'Всего как будто и не было',
    text: 'И впрямь нет.',
    author: 'Татьяна Андреева',
    tag: 'Интересные истории',
    time: '09:30',
  },
]
